Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::TypedCalculationResultColumn< T > Class Template Referenceabstract
MEP Element Manager
Template typed version of the ICalculationResultColumn interface. More...
#include <MEPSystemBrowserCalculationCallbackInterface.hpp>
 Inheritance diagram for ACAPI::MEP::TypedCalculationResultColumn< T >:
 Public Member Functions
virtual bool  | IsLess (const std::any &value1, const std::any &value2) const override
True if value1 < value2.
virtual bool  | IsEqual (const std::any &value1, const std::any &value2) const override
True if value1 = value2.
virtual std::set< ACAPI::MEP::Domain >  | GetDomain () const override
The domain(s) of the column.
 Public Member Functions inherited from ACAPI::MEP::ICalculationResultColumn
 virtual  | ~ICalculationResultColumn ()
Destructor.
virtual GS::UniString  | GetId () const =0
Globally unique ID for this column.
virtual GS::Int32  | GetDefaultWidth () const =0
Starting width of the column to present the calculated data.
virtual GS::UniString  | GetTitle () const =0
Header title for this column without the unit.
virtual std::optional< GS::UniString >  | GetUnitToDisplay () const =0
Unit to display in the column's header title.
 Protected Member Functions
virtual GS::UniString  | FormatValueToDisplayText (const T &value) const =0
Formats the value to a displayable text.
Detailed Description
template<typename T>
 class ACAPI::MEP::TypedCalculationResultColumn< T >
Template typed version of the ICalculationResultColumn interface.
Since
Archicad 28
class TestColumn1 : public ACAPI::MEP::TypedCalculationResultColumn<GS::UniString>
{
public:
 // Inherited via TypedCalculationResultColumn
 GS::UniString GetId () const override
 {
 return "TST1";
 }
 GS::UniString GetTitle () const override
 {
 return "Test1";
 }
 std::optional<GS::UniString> GetUnitToDisplay () const override
 {
 if (UseMetricElseImperial ())
 return "kg";
 else
 return "lb";
 }
 GS::Int32 GetDefaultWidth () const override
 {
 return 80;
 }
 bool IsLess (const std::any&, const std::any&) const override
 {
 return false;
 }
 bool IsEqual (const std::any&, const std::any&) const override
 {
 return false;
 }
 GS::UniString FormatValueToDisplayText (const GS::UniString& value) const override
 {
 return value;
 }
};
Member Function Documentation
◆ FormatValueToDisplayText()
 template<typename T >
 virtual GS::UniString ACAPI::MEP::TypedCalculationResultColumn< T >::FormatValueToDisplayText  |  ( |  const T & |  value | ) |   const
protectedpure virtual
Formats the value to a displayable text.
Parameters
value | The typed value to format into a displayable text
Returns
The displayable text
◆ GetDomain()
 template<typename T >
 virtual std::set< ACAPI::MEP::Domain > ACAPI::MEP::TypedCalculationResultColumn< T >::GetDomain  |  ( |   | ) |   const
inlineoverridevirtual
The domain(s) of the column.
Returns
The domain(s) of the column
Implements ACAPI::MEP::ICalculationResultColumn.
◆ IsEqual()
 template<typename T >
 virtual bool ACAPI::MEP::TypedCalculationResultColumn< T >::IsEqual  |  ( |  const std::any & |  value1,
|  const std::any & |  value2 ) const
inlineoverridevirtual
True if value1 = value2.
Parameters
value1 | first value that is checked if it equals to the second value
value2 | second value
Returns
True if value1 equals to value2
Implements ACAPI::MEP::ICalculationResultColumn.
◆ IsLess()
 template<typename T >
 virtual bool ACAPI::MEP::TypedCalculationResultColumn< T >::IsLess  |  ( |  const std::any & |  value1,
|  const std::any & |  value2 ) const
inlineoverridevirtual
True if value1 < value2.
Parameters
value1 | first value that is checked if it is less than the second value
value2 | second value
Returns
True if value1 is less than value2
Implements ACAPI::MEP::ICalculationResultColumn.